node {
  name: "global_step/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/initial_value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "output"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "HistogramSummary/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "X"
      }
    }
  }
}
node {
  name: "HistogramSummary"
  op: "HistogramSummary"
  input: "HistogramSummary/tag"
  input: "input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "HistogramSummary_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "y"
      }
    }
  }
}
node {
  name: "HistogramSummary_1"
  op: "HistogramSummary"
  input: "HistogramSummary_1/tag"
  input: "output"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
          dim {
            size: 120
          }
        }
        tensor_content: "\347\247\177=\302\201S\275\257\227\220=\222#\025\276d\037M>X\373\207\275{\013Z>\014\364\352\2754\375\027=\016\177%\275\247K!\276\340\217\234<\245\363\000<X\246\354=\017_@>v\3555\276\204\345\006\276\302 [>7\330\352\2751x\347\275[\371d=\271[\320=\223\006\247=#\346O\276\006z2>,d\275\275hE\305<\374.[\275\252\345Q\276(\t&\273\023j\024>\370\351k\275\225A\332;\254\364C\274F\354I\275\316\200\330=\346\033\222\275qE)=\005\016\243\275\277X\210\275$I\342\275P\213\257=aT\377\275\343]\316\275\373\251_\275\231\241\001=\004\0179>\177o\r>\347X\025\276\376\375R\276\006o\374=\336\206\320\275ns\216\275\237d\013>\264S\010>\025\2656\273\377\034\031>\014\032o\275z~H\276k(\321\275\377+\200\274\036x\253=7r\245\275\031\344\204\274H\300\r>\306\233\243=o\014\234\275=<\010=JEk=\033\026+=\341\226 \276\373IQ=\237|9\2730\006\036\2762\tP\276N\271B>\205\243\327\275e^D\276\267)G\275\301t}\275H\252W>\254\352B>\322\317\022=\367\244Z>\005;Y>*\336!>\357\376\025\276\223?i\275\220e\253\275\303\037\215\275r\316\271\275\273\204t=\005>G\276\201\366@>&>R\276ov`<\371\363=\276\266\321\251=\n\311)\276\351\345\007\276\036\3326>\264\334\247\275u}\243\275\201#\010>\033\262\037\275\277v\251;\301z\032\276\204!\"\276f\331V\276\244\225V\275\376\3302\276\371\023\315\274\352B\373\275=\363\020>\220o\237=\315x\314\275\360\230J>\253VV>:8\264\275n\354S=\261\355\021\276V\2420\276w\2662>\r\363G\276\364\020\035\276\027\2462\275\024\346!=%F\235=t\254X>#\347\207\275#m\275\275\313\362\265=\313\210\374\2748\356\r>o\315#>\202\235\370=\211%\002\276L\335\033>0\206i\275\301y1>\000\303\266\275\263\374t=|S\000>\3275\360\275\352`\305=\252\324\306\275]WG\276h\355O\276f\257\256=\276\200\361=o\204\037>\233^\342\275\2457J\276\274\366G>\333\365\032>N\227\367=r\0051\2757i\332\275\232\221\027\273\351{\257<\252v\020\276rt>>\310\240\r\276&\321\306\275\276\235\316\275\205>&>:\240\026>\036=\000>i\206\255=\335\241\">\300\037\206<\203\\\255\275\305\262#>\315\357\232=\352M\006\276\261\227\000>0&\007\276\3571\265<\301p\254<\364\306\274=\333$\031>\323\217\034>\241\204\020\276M\266\271\275\213=\375=P\243\035>\305\313\304\275\355\333\250\275i\177\236\275\320\356B\276h\270Q>\000\231\357=\314G\220\275OIS\276\301\004W=#\260\203=\256\325\\\275\202\236M\276\306x >\241\214H\276\0130\374\274\364\215\\>t\266\252=\211i!< Q\177=\313\356 \276\347\n\205=6\241\230<\2727N>\373\353\322\274!\246\341\275saQ\276\347{\313=\004Q#\276v\332\223\275y\341@\276UT]\275T\3202\276\235\324\261\274c\322\t=\307\374\027>_jn\275\177\257\272\275\333\254U\275U\003\244=6\357\032;\262\303\033>I\213\347=\307\335\002\276\305R<\2769VT>y\'\263=\361\266+\276\202\316V>a\274\316:\324cF\276\323\262\022=o \027\275TR>\275/\013V\276\225\007\014>\267\323A>\005\332\305=\360o\'\276h\330\207\2749\"\204=\3349\230\274j;\\=\224e\371;u\373\007\276\234\361\205=%\230\325\274\330Bf\275\031\300&\276\300\246\004\276&\364=>\035\231z\275h\217@\275\275=A=\342\026\304=\004\243\257=\351b(\276\333D~=\005\375\017>u\334\321=\364\327\023\276\247\336\317\275Y9V>84\225\275\355\314\226<\n[6\276\246\304\233=-d0>\250\353K\276\210q \276\352\006\241=[\343:=\250\305J\276\220\234\241\274= X>\'\211I\276\351\257\r>\034&\336\275\275\313\327=\336\322\252=\341\313\221\275\035\004\n\276$\274\025>O\300\201=\230\025\024\276\034\0244>k\313\300=B\312\021;,\213.\276)*U\276A\016\003\274!\373\242\275\022\300\r\276fo1\271g\000\315\275\212\207#\276\310\355\003\276\200_\227<\263a\022\276qx\324\275\273\222\300=\240\253\026\276\330\230\227=\251\020(=\233\026\\\276\350V\003\276h\334\271<\202\217@>\256\302\252=\366\221\035\274\203\242\365=:\335O>0\330E\276%\327A<\302\256\035\276:L\217=.\006O\276b\001S\275\245G\377<\334\"z\274\025f\023>?:\264\275\247\234\203\275\303;]>s\220\201=\351\315\000>\240\030:\275Z\221\305\275\253\272\006>-\204\270=(\026K\276\364\256@\276f7Z\276\233\244H>,l7\276\370\350\375\275N\320F\276\300\233\336<\203\033\177;\215\027S>\010l\274=G\323(>\365 Y\276\252\005\301=|L)\276o\3566>\341L\000=u|\206\275\271\332\277=\320\035\242=rP\001=\026\352\n>\034\222\365=\217\330P>\274\361\000>e\0259\276\322\326\221=\362\006\307\275]\263\215==\317\211\275q\351\001\276\022\363\334\275f:\363\275\344\250[>\024\374\233=\"\311C>\341\251\037\276J\030a8\016\300)\276I\314\267\2753E\r>\343W\022>H_\332=cs\233\275\227\202F\276q\205\277=\355E\326;,\203W>\321q&\276\363\2211=e\340\265\274\206\020\274=%\201C\276G@\031>Z\335U>&\235\323\275\027+\034<u,\322=\331\0201=`Q;>^\2068\276\265~<>\356\323\250\272\024S>>\257\277P\276\365\341G\276\021\320\213\275\364\026Z>\030\014D\276\206\006.\274\\_\277\275\213\247\235\275\0365+\276Y\000\247=kwQ>\217\374\310=\235mo\274uP3>$\2345\276\201\336\243\275\325\364\353\275\351t\033;a\253\311\272<\375\264=\215\320\025\275\312\261\200=O\247$\274\024\000Y>kY\244={>L>n(\006\276\366O8>\260\335&\276XO\026\276y\265\212\273!\250\331\275\270y4<\330\001\364\275\330\246\306=\302\216\333=u\320F\276\223\351\377;\375\303\225=I\274]\274\335\021\033>\014B\232=\0337\336\274_)*>4\\\343=A\202\217<\374\236\025>\253AX\276\277h\027\276\343<\221=Q\331G\276\037M\036\276\246\006\027\276\206\2212>\005J\327\275\371#L>\371+B>{S\017\276\273\273\260\275@m9\276\0256\"\275C?\020\274o!5\275i\316\303=+\235C>\276\231\373\274ZB\307\275\026\302A\276y(D\276\021Z0=\231\232\356\275<~\271\275K\212\334\273K\271\206\275a\210\200\275\236\265\021=uE\\\276\225\244s=\341\225\253\2745\031I\276Q!->\253\315\340\275\225^V\276I\310\033\276\310w\345\275;\t\220\275\257\007\231<k|A>\225H[>\271\'L>\262\273\371\275\210_?>8\264$\276\337N9>\220\306\302\275C\343I;\035s\244=\210\313\257\275\362\376\330=s<5\276N\327\024\276g\321=\275\027% \276X\264\t=\265\035\364\275\261\223\t\276\346H\022\276\266yw\275\214\353\200<\ry3\276\022\031\016\275\261\323C>\277K\014>\201+\273<[\355\210\2746\253\366\275\325/\344\275&\306\265\275\003\313v=\271\346)\276}\363Q>\362\023#<c\177\030>w\201l=\023\233\030\276\021\327\272\275\320\275\n\276,D\235=\243A8\276\377xV>\276g9\275<\036\306\275\315\355Y\275\001\'\344\273\264\334\020\276\'\026L\276O!\264\275\332;[>^\357\003\273\010\371\316\275\2532\275\275\365\305K\276\n\2752>D\336.\276\273\276\276\275\reA<x\260\361\275\321\364O\276\225f!\276d?\211\275\345\275\223\275\027PW=\017\356\n>zrp\274\346\214\303\275\246\376-\276\376\374\004>K\377F=\r\177\014>\266\036H\275X<\244\274\376\327\240=\237\316S\274^|\264\274\266\354*=\014C\024\276\025t\273;\177G3<,\005\365=\262\353/>\342\255\243;\345\213G\276\233H-\276q\213\004\275NN\305\275\2510\240\275\013\231\243=\327w\032>+J\266\275\370Dq\275\323\033\221=\375\257\016>8\370\270\2753\340%\276\250\235\211<oN\330\274m\272\310\274AK\247<\352\322\217=E1\212=\355\230\306\275\224\310\314\274v,\202\275M\305\310=\357\306\272=\333o\200=\305\017\021\2765\350\023\276g\354\005\276\350\346W>\264\246*>\343\213\031>\rx:\276\271a\023\276a-\245\275\310\304M\274\331\331\031\276|_*>\215\035\024>:\300~=\233\361\350\275\000\373\356=#)g;N\307C>\314I^\275\371\363\211=WL-\2725kD\276\250F\232<\351\216\t>\3347\367<}\343W\274\252\326=>8H\017\275K\3424>&\206\361=~\322\310=\240h\275=ye\223=\213\345A>\236\3430\276\323$\024\276d<\031>\303\\+>\005\271\037>18\244\275\236\032\001\276m\217\341=\005\243$=c\034@\276\217\000\231=\225\004\341=\"0\205\273\241\rS>\300#&\276\374\212\272=\254\301\356=,~N=\315\007\370=\214\362,>\245\253\005>Z\351/>-r\t>\215\027!\276\023\037a\275\373\342\267\275o\3077\276\371\377/\275\253\251\215=>\374\340\275\360w:>\'3\252=\0108H>r\344Z\275\020\007\352\275+\366\030>\355\373Q>\026\242%\2763O \276B\352\324=\370\241G\276\312\367T\276\243\205\275=\373\216 =rS\312\270;N<> \325!=\267\366\351=\003{Y>L\033\335=\276B5>\\O\204\275\032@\315\275q\023\214\275>\340;\276?g@\274y\355,>\377\307\375=}\372\370=-\321,\276\340\032\200=\374[[>\252?\013=#\2332>\300\000Y>G\333\313= n\255\275\020\274;\276\217\002\322\273\205s\t\276(\251G>\253\230G\276Gv\243\275\235\022=>=\303\223\275\000\227D>\376<\266\275`\001S=\223q\010=m\261\270=nR\204\275h\337\203\275:C\301=\001\376\200\275=\023\005>\364\376P\2766A\235\273\260\201\027>C\217\240\275]Q\n>O\243G=\255=\">\342\342\253<\027\215\353=\311\333\202\275\214\343.\276\271\026\346<_\357\270\275\360g\246\275\037\273\335=\216\231\252<\262Z1\276pD\254=\271H\031\276\273\304\307=\014e\257=z\224,>\020\253D>^\005m\275{\203)>\202\030Y=\004\372\321=\254\252!=kg\341\275Z\260\031\276\3554%\276\315\346\236=\204\007\346\273\256\322\250\275\373\371K>\037l\216=\351Y(>\340\346\010\276\322\360\371\275I\255\307=\230UV\276X\253=>h\357\036\276\020\302Y\276C@\341\275{\316C>|vS>\250\237\324=\262\367\023\276\020\313\346\274-\231\021\275\326\2406>\2148\303=\375\375\247\275\340\317\307\275\240\276\376\275lU\331\274\274#W\274X\227F\276i>\031\276\021P+>\236\001\323=\363lD\275\223e\010\276\200\205 >Lw2>\001\r;=\331\025\037>^\3200>\031\335\002>\302m>>R\036Q\276S\320\022\276\222\3658\276\326\237\214={v\021>\321\276\256\275z\324n<\335\024\210=\302k9=6\202\022>\032|\363\274Rib\275\304$\003>0\244\\\275c\025\t>%\232\337\275u\023\360=?\337\336\275\377dF\275{\322>>\262\333\305\275\003M:\276\275|*\276iQ[\274?\004\240\274\362L\022>&\226\023=.\243X>\265\332\026>\356<\250\275\3620\006>\0021N>X\353:\274P\n\227\275\274\377\370<\251\001\007\276\310a\242=\320\3514>\220KD\276H\365@>\375\345\221\275\200C\214=\253\357\273=D\225\220\275\271\205\036\275\266\235\212=cp\231=S\372I\276\006\206W\274y\271C\276I\352\003\276\036\351\240\274\037\016\014\276}*\005\276\036\027O\276\340VU\276\265%\255<e\363\247<R\264\335=\367)\263\275\206k\303=\3663\215<\035\013\350=.\264\007\276\"\316\333=\2762(>\237\256\035=B\355-\276\240\254,\276\355{\031\274\333\315N\276\323\377\022>\005T\340\2757\3117\276|\256\344=\227\004\311=\332\245\317=!\024\325=\303\363\017>\276G:>\017\241\027=\366\311\023\276=\224\355<s\004\217\273\373LM\275\210\020\331\275\271\320\357=\222\345\233=\352\200`=\224{\315\274x\000+\275\021/!>\035\317\">\3660O>\206T<\275H\217)>\355o\214\275Y\347)>\337~`=\370\033\347=Xc\014\276\324\200v\275\325;<\276\333\255\225=\255\254\013>\275\264\r>,\252\232\275ne\024>\210R\226\275\2259U>Ii\\>n\0263\275*R\035=\031\252\030\275\010?\016=\317\341\324=\257R\036>`;J\276Sp\027>\243)4>7\366P\276\330\346\263<\007\261Q>(\315\214=o\007\253<S\r\240\275h\r\007\276\274\2416\276R\006\025\276\003\240\332=p\330B\275\316\226<>\326\267\220=\024/\222\275\213[\336=\r\0233>D\2321=\356\275\373\275\1773\031\276\371\030\'\276\324f\005\275\350b\236;\233\024K>f\0024>\331\204\343\274\324p\020>\356\014\227\275\275\241C>\035\232\010\275\326\207i=R\017X>\354R\026>\250\263Q\276\373\313\030=\233\036N\276ii\300\275\316\371\203=\255\2502\276\325\3335\276\036\376\304\275 \3766\276\374uu\274pk\377=\006qZ=\271q=>t\346X>\245\007\360\275\'b\230<\2013\276\275\346Wc==\315F\276NI\254\274\032U\225\274\021p\217=\361\365-\276"
      }
    }
  }
}
node {
  name: "fully_connected/weights"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
        dim {
          size: 120
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fully_connected/weights/Assign"
  op: "Assign"
  input: "fully_connected/weights"
  input: "fully_connected/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "fully_connected/weights/read"
  op: "Identity"
  input: "fully_connected/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected/MatMul"
  op: "MatMul"
  input: "input"
  input: "fully_connected/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "fully_connected/bias/Initializer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 120
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "fully_connected/bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 120
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fully_connected/bias/Assign"
  op: "Assign"
  input: "fully_connected/bias"
  input: "fully_connected/bias/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "fully_connected/bias/read"
  op: "Identity"
  input: "fully_connected/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "fully_connected/MatMul"
  input: "fully_connected/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected/Relu"
  op: "Relu"
  input: "fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected_1/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 120
          }
          dim {
            size: 4
          }
        }
        tensor_content: "Z\364G>c\\9\276{\007\260=\3700\264=\236]8\271\366\335\233:\337\2010>&-9\276\016\214\034>\326o\201\275\335C`>\323>\356=Mq\350=\206S\265=\230Q\357=\025\306^\276\370\'#>\202S\227;\337.0\276\255\237\177=\200[/>\343+\027>\311\214+>\340\350\250<\370\267J\274\276\334\024>\234\177k<\020\027\343\275\366\363\224=a\037\221<\207>|\275[Q\211=\210\213\036>L\335\030>\241\221\000=\3509\364=\243\017+\2763\217N\276\247y\356<>\001\262\2751P\207\275\312\375\n\276\213\340?>k\0336\276\302\354>\275H\262A\276ib\346\275\210\260/\276\263\353T\276[+4\276\2678_>\272F\217=\245r\246=\256W\273=\342\036v=\304\206\"\276\257\375\006\275\243\270\023>\326l\241<m\323\270\275\313\032\26696I\033\276\014\036\026=\344\3046=\345e\343\275:\254\202\274\320\n\344=\333j\231=\277{\353=\364\254\033\275i\207\024\276\331\213\237<\352d\357\275\325\213\037=M\361\251\275A\254`=\000\0372\276\352?\216\274\007\014(>\036O\255\275\214\t9\276p\267#\276Oz\334;\374\221>\276\263\355\247=\240e\316\273e%M>\323+6\2764\312\346\274\234`\307=\232\252L>.7\"\275\313\240^>\352\204`\275\2545.\276\t\371\004>\363\261B\276x`\311;\307:d<\274n->\201e4\276c\234\273=\341\343,\276o]!\274\205_\207\274Y\'P\276JI\251<\272\250\033>\261\027\360\275\352\276%\276\276J\000>Lj\\\274@\2353>\3427\310\275$lQ\276\332[\213<\014\326\265\274h\245W>K4\"\276j.\322\273\017\022\346=\220\216\324<\274\271\t\276H@\350\274K\234<=\222\\M>\223&\235\275\245]\220;\2563\271\275\373\362\035>S?#>\317y\271\274\240d\254\275h\"\211\275C_\346\275v\373\221\274E\n-\275\031\373U\276ESH=\313\320\035>{\335\364\275\021]\365=\341\224\216=4bF=$\2410>\332\311K>{?\\>\254\007f\273\307\036p=2OH\276F<B\276\000C\014\276\212\377W>\032\002\037\276\375\3478>\206\213<\276%~\217\275\234]\366\273)h\010\276t?\244=2\205J>\357-\325\2756\233P>Qw&>\242q\004\275\372\2526\276\0257\244\275\260\220J\276\306\333\215=s\371\212\275\317\2669>\367\264\233=\035\222B>P\272M<\274-\036>\267\230J>\333\357\200=`\224\360\275`\371\034>\r\010\002\276\036\223\256=\017E<>\227{.>\212o&\276\264\021\023>u)\267\275#7\227=f\020F\276\230S\327=0\341\t\276F\256f<Y\017\373\275\370\312\n<\230\340\010=m\243_\276v\007\036>:\360\027\276\260\360\204=O>W\276\200\357*>x\235&\276\002\000\034\276\215gI>\347\331*\275]\n@=H#$\276\340\032\272<(\023\001=B \000<\230\177\305\273\247\343\r\276J\373]\275\227\270j\275N}\301\275\262s\035\276\r\305J\276\344\350+\276\247_&>\317\321\263=\225\311C>\244\237\023\276\207\013\206=\004\217i=SR\235=\362\312.\276^\375\252<{\032\007\276\270\030>>\"\334X=\316\302\363\275\315\\\212\275\362\366Q\276\325\333\302=\023\240A>`\271\303=\204\347\326\273\350\244P>\344jS>\010rW>\024]M>\214\324M\275\'\214\204\275\246\016*>\005h=\276\024B\252\275]\320L<.\251{\275\203\375b=f\003\r\275:\313\365\275\257W\245\275\005;W>l\237?\276\271\'\255\275:lF\276b\346\260=\350NJ\276\021\010\237=\242\361\357<\3546#=)\237\020\276\\\213}\274\206\245]>\213.\267=d\024$\275f\343`=zT\250<\325B\350\275\240\262\253<l*\210\274`_\207\275\250\210z=\2154\027>y\" \2767\0174=\033\371\002>\376l\246\275:B\032\275\374#)\276)/\031\276(\346\033>\266\375,\275>\335\367\274\321\3473>^Y\034\2766\335!\276\312e\020\275\225TA\276\300\n\374=\237{c\275\364\236\330\273\243FH\276\316\301\013>\311\320\271\2758\301\251\275\035U\007\276y43\273\204\230)\276=\261\337\275\325\243\203\274\315l0>\270\214\353\275\031\321\003<(\026\020<\351\365\225\275\3340\036>XW\236=\034\277)>\004V\000\276\374fZ=\376F\030>\201+\016>T\340\360\275\033+\233\2731\377B\276q\304\007>\021\315\343=#*\353\275\227\333\030\276\315u\265=\235r~\275\003\266B>%0\372=\332\020G>\220\250Z>\354\266W>\222R\372\2745\023,\276\"&\005\276S([>\223v\305=Mw#>\305V\222\275+\002A\276\355\201\264\275L\227\264=\360P\363=\n\0164\276\273k,=:\345>\276S\2112>\003\225\020\2760\316\276<\2502T>\311CU>\014O_>\rfZ>{G9> \226(\275\257V\306\275\025\002\026\276\222d\023\276\243^\026\275\276uD\276\231\371H\276\303y\242\274.$=\275\221\023Z\276\342,\226=\030\214\010>\344\027\370=\200k7\275Vh\357\274_\020\301\275G\212\035\276\343\020^>\203\325\356\275\373?)\276\3547\326=\202\265\327=\035\235E\275{\337\355=Z\032\007\276\254A\035;\340\367\364<m\257\301<\270g+\276\3251\335=A\251x\275\272\010\260=\204o\005>\026\235\213\275\200\3100=RQ\201\275P\312\010\2761\337m\275\324\3403\273_\247\367\275\213\271=>\n\\\020\276\341^W\276\013\221\263\275\343{`\276D\366\352\275\353\301\372=[\004\241\275\230\344\303\275Q\262\001\276e;\263\275{_\021>\3535\240<\232\014\252\274\017\313\t>\303\005\001\275\220\361 =\"Z\340\274sF\021\276v\300O\274|\321&>a\"\377=\235\206\234\274yeo=\n\231]>\002x/>\246\013\371\274\244\\\006=\272:\036>>0<\276\361\315\305=\364_\310\273\346\211N>\243_~<\350)\330\275\337\272\237\275}\257\314\275 \266\235=i\003\277\275\033\0246>I\310\372\275l=,\276s\235\261\275\227\267\215\275Z\353O>\200\305\325\275=t\325=p\333:=6l\267=H\321\225=K\305J>\273\307]\276\310b\347=\326\026\223\275\332\3331\276X\2157=\354\2110\276\2450>\276\316\315\016>\243\\v=\237\262R>\250\r<<\'\010!\274\n\216\263\274\005-?\276\233\301\010\275\032\363\261\2753cW>,\323B>\374\216\354=\030$@>\211\245?>\213\354{<\300B\207\275c\202n\275\360\266w=[\013\t>\030\300%\276\033\0202>\307r\n=r\321W\276\237\220\230=\230\261\"\276X\362\246\275\221\\\232\273\005\310\204\275\231\006\375=\221\260\277:\271v\254=v\200\025>\036\224&\274yS\233<"
      }
    }
  }
}
node {
  name: "fully_connected_1/weights"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 120
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fully_connected_1/weights/Assign"
  op: "Assign"
  input: "fully_connected_1/weights"
  input: "fully_connected_1/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "fully_connected_1/weights/read"
  op: "Identity"
  input: "fully_connected_1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected_1/MatMul"
  op: "MatMul"
  input: "fully_connected/Relu"
  input: "fully_connected_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "fully_connected_1/bias/Initializer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "fully_connected_1/bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fully_connected_1/bias/Assign"
  op: "Assign"
  input: "fully_connected_1/bias"
  input: "fully_connected_1/bias/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "fully_connected_1/bias/read"
  op: "Identity"
  input: "fully_connected_1/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected_1/BiasAdd"
  op: "BiasAdd"
  input: "fully_connected_1/MatMul"
  input: "fully_connected_1/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/HistogramSummary/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "linear_regression.X"
      }
    }
  }
}
node {
  name: "linear_regression/HistogramSummary"
  op: "HistogramSummary"
  input: "linear_regression/HistogramSummary/tag"
  input: "fully_connected_1/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "linear_regression.y"
      }
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_1"
  op: "HistogramSummary"
  input: "linear_regression/HistogramSummary_1/tag"
  input: "output"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\004\000\000\000\004\000\000\000"
      }
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.866025388241
      }
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.866025388241
      }
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "linear_regression/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 38
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "linear_regression/weights/Initializer/random_uniform/max"
  input: "linear_regression/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "linear_regression/weights/Initializer/random_uniform/RandomUniform"
  input: "linear_regression/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform"
  op: "Add"
  input: "linear_regression/weights/Initializer/random_uniform/mul"
  input: "linear_regression/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/weights"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "linear_regression/weights/Assign"
  op: "Assign"
  input: "linear_regression/weights"
  input: "linear_regression/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "linear_regression/weights/read"
  op: "Identity"
  input: "linear_regression/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -1.73205077648
      }
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.73205077648
      }
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "linear_regression/bias/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 48
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/sub"
  op: "Sub"
  input: "linear_regression/bias/Initializer/random_uniform/max"
  input: "linear_regression/bias/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/mul"
  op: "Mul"
  input: "linear_regression/bias/Initializer/random_uniform/RandomUniform"
  input: "linear_regression/bias/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform"
  op: "Add"
  input: "linear_regression/bias/Initializer/random_uniform/mul"
  input: "linear_regression/bias/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "linear_regression/bias/Assign"
  op: "Assign"
  input: "linear_regression/bias"
  input: "linear_regression/bias/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "linear_regression/bias/read"
  op: "Identity"
  input: "linear_regression/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_2/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "linear_regression.weights"
      }
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_2"
  op: "HistogramSummary"
  input: "linear_regression/HistogramSummary_2/tag"
  input: "linear_regression/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_3/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "linear_regression.bias"
      }
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_3"
  op: "HistogramSummary"
  input: "linear_regression/HistogramSummary_3/tag"
  input: "linear_regression/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/xw_plus_b/MatMul"
  op: "MatMul"
  input: "fully_connected_1/BiasAdd"
  input: "linear_regression/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/xw_plus_b"
  op: "BiasAdd"
  input: "linear_regression/mean_squared_error_regressor/xw_plus_b/MatMul"
  input: "linear_regression/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/sub"
  op: "Sub"
  input: "output"
  input: "linear_regression/mean_squared_error_regressor/xw_plus_b"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/Mul"
  op: "Mul"
  input: "linear_regression/mean_squared_error_regressor/sub"
  input: "linear_regression/mean_squared_error_regressor/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/Rank"
  op: "Rank"
  input: "linear_regression/mean_squared_error_regressor/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/range"
  op: "Range"
  input: "linear_regression/mean_squared_error_regressor/range/start"
  input: "linear_regression/mean_squared_error_regressor/Rank"
  input: "linear_regression/mean_squared_error_regressor/range/delta"
}
node {
  name: "linear_regression/mean_squared_error_regressor/Mean"
  op: "Mean"
  input: "linear_regression/mean_squared_error_regressor/Mul"
  input: "linear_regression/mean_squared_error_regressor/range"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "ScalarSummary/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "loss"
      }
    }
  }
}
node {
  name: "ScalarSummary"
  op: "ScalarSummary"
  input: "ScalarSummary/tags"
  input: "linear_regression/mean_squared_error_regressor/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MergeSummary/MergeSummary"
  op: "MergeSummary"
  input: "HistogramSummary"
  input: "HistogramSummary_1"
  input: "linear_regression/HistogramSummary"
  input: "linear_regression/HistogramSummary_1"
  input: "linear_regression/HistogramSummary_2"
  input: "linear_regression/HistogramSummary_3"
  input: "ScalarSummary"
  attr {
    key: "N"
    value {
      i: 7
    }
  }
}
node {
  name: "learning_rate/Initializer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "learning_rate"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "learning_rate/Assign"
  op: "Assign"
  input: "learning_rate"
  input: "learning_rate/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "learning_rate/read"
  op: "Identity"
  input: "learning_rate"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Shape"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "gradients/Fill"
  op: "Fill"
  input: "gradients/Shape"
  input: "gradients/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Rank"
  op: "Rank"
  input: "linear_regression/mean_squared_error_regressor/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_1"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/range"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range"
  op: "Range"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range/start"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Rank"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range/delta"
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Fill/value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Fill"
  op: "Fill"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_1"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Fill/value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/DynamicStitch"
  op: "DynamicStitch"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range"
  input: "linear_regression/mean_squared_error_regressor/range"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Fill"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/floordiv"
  op: "Div"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/DynamicStitch"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Reshape"
  op: "Reshape"
  input: "gradients/Fill"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/DynamicStitch"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Tile"
  op: "Tile"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Reshape"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/floordiv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_2"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_3"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Rank_1"
  op: "Rank"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_1/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_1/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_1"
  op: "Range"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_1/start"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Rank_1"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_1/delta"
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Prod"
  op: "Prod"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_2"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Rank_2"
  op: "Rank"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_3"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_2/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_2/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_2"
  op: "Range"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_2/start"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Rank_2"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_2/delta"
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Prod_1"
  op: "Prod"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_3"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/floordiv_1"
  op: "Div"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Prod"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Prod_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Cast"
  op: "Cast"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/floordiv_1"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/truediv"
  op: "Div"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Tile"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Cast"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Shape"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Shape_1"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Shape"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Shape_1"
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/mul"
  op: "Mul"
