node {
  name: "global_step/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/initial_value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "output"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "HistogramSummary/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "X"
      }
    }
  }
}
node {
  name: "HistogramSummary"
  op: "HistogramSummary"
  input: "HistogramSummary/tag"
  input: "input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "HistogramSummary_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "y"
      }
    }
  }
}
node {
  name: "HistogramSummary_1"
  op: "HistogramSummary"
  input: "HistogramSummary_1/tag"
  input: "output"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 36
          }
          dim {
            size: 34
          }
        }
        tensor_content: "\200\302N\276\237oQ>\256\344;<\240u=\275k@7\274\326\232z=]6\220>\264r\005\275b\314L>-\350\237\275\356Pu=\344\305Y=\267\241\207\276i\374\326=\207\202\203\276=P\023=v\007[=\273:z\276\246g\211>\252\372\213\276\341\331=<3\232\310=\372*\205\276S\025\201\276\216nV\276<e,>\016\026\353=\031\200v=r\265\243=\302{\310;e\\\033\276\231\250E\275o\327\014\274\273\021\004>\250\326\206\275\363W\024\274@\014\202>\251\'.>T8\227=E\325I>E#\272=I1X=\006p\261=\277\021g\276\351\321\016>\233Gt>\326\260q\276f\276b>Yj{>\346\345,\276\240Vk>\343\315\017<\357\336\311=\350o5\276\223~;=\271\372\036\275\241\214\036>:\310\201:\370\377\202\275\265\0109<E\325(<\361\232\007<C\314V\276j\246\350=\211/6\276h)\362\273\223\202\215\275\202o\267=P\022\177;\256\264\205>\301c->\020AD>\267\200t>\204g7>\345\204T\276=\224t=\376?\211=\301Q\345\273+Cj\276\000,\236=\034\235\001\2760\034|>\211\203<=G\215\230=j\035\334\274=lQ\276\261\272\022>\325N`\276O\266I=\262,\343<\021\003\356\275u\331\005\276\326\255e=\'\244\215=<U\201>{\217r\274\3212r\276\311y<\276\342\220V>\001n\335\275r4\'\274\3126\223\275\237!x>\253\206\315<]\315\r=s\327\"\275\357\337\263<K\n\263\275\334\346\224>Fs]\275\377\360W>\347\266Z=%P5>G\216x>T\307\311\275\037\205\272\275\031\007\200\276x\326C\276\217q\t\276H\371)>\244?\016<M\200J\276\2606\023=\260\355\210\276\354\001I> `\036\276\236\330\371\275\347Z[\276+\361\237\275\030h}<X\222D\276\225\301\204\276\227\n\361=\264$=\276\375\026\222>\344\235\024=\"T\r\276d\031m\276{l\220\276\346\034\250<~\357\306<\003\3606>\371\205K>\247\275A>3R?\275\"\342\202=\234\261\t\276\n\027^\276\303\307y\275\252/\236\275&1/\275x=T>\226T\233=\241\213#\274\0258W>e^I>\2131\207\276SF^\276\375\212\010\275\023\236;>\3674\210\276\177\332L\276Q\177r\276\337\370\260\271\317\\\217\272x\336\037\276Dzp>\320\355\245=(\274\000>\330f\205\276Bp\r=\327\223\031\276\253\266\024>#\250\211\276e\033\026\275\032p\003\2766\0233>\215\375\202\276\251{\213\276\320\000o>\273D\224\276qB\277=(6\035\276+\234\205>b\331\317=2\203^>9k\204\276\341\347R\276x\0048>Y\321\311=6\235>\276\025\010\030>>\226\216>A\275\";$\233\376\275\3569\346\274!g=\276l\354\210>\260*\273\275\250n\322=y\263\177\276\331\357?\276\234\1779\276|\212\313\274\305\227\321=\026\304`=\nq\267\273\331\361E<\240^R\275T\365+\276.\202\207<\034\332M>\0003-\276\367~\013>.\224!>\030Q\221=\367\203\315=B@\024\276\243_H\275\364\254\016>\001\375\331=\t\313\017>\240H&\276\373\026\201\276\200E\324=\010w\010\276\315\207t>\211k >\217\304\326\275p\320\223>\232\215&>\306X\212<\335)\331=\231\"\212\276\374\227\216>\025\020\240\275\035\306\212>Q4+=\314\323\031\276\021\004y\276]\\A\276\023D\304\273R(\220>,P}>\235\315z\276\007\224^>6\224\375=k\330\'>\2645,\275\355\254\216\276\205\367D>\350\311C>\270^\246\274\016\235\242\275\335B\224>J \002\274\350\203\240<^,\261=:Q\224>|\347\017\276\200\017\323=/^\340=D\365A\276\216xy>\030\323n=\021\374!=7I{>x\n\027\276\r\021\027\276J=8\276\224O\301\275\030\307@=\010\003S\273\3434\212\274%\371)\276\216\035B\276\314Y\200\272G&\242=\222\310%\276\204\370\230\274\"\212\\>\336\250(\275\272\247a\275=~U=\370.\002>\036\t<=\335;\214\276\274\332\346\275\027\356 >\335\223\330\275\300\3458<\306>J=1\320\260=\235\231\211\276\244g\231\274w\271P>R+\270=F\357\306=a\347\r>\272<\376\275F\345W=\320\230@=\361\300\214\276U\034\365=\230\252\223>\324\302\024\276\206HN\273\271\360\341=e\250`>eGw>\311\026\004\276\330\222\'\276\217U\263=\371\302\024\276=\022\332\274\227C_>R\306#\276P\256\243\275\366~R>\300\212N<\201W)>)J?\276G\366c=s\253\031\276g\324\225\275T\226<>0\035\025\274\027m\005>t?j\276\317\014\337=t\207\342=p\373\246=\263\311H\276\r\025\301\275\311 &\275,*k\276s4\341=\247\330\005\275\335F\204\275.\221\337\274\030@\317<\263\263)\276\376\341W=kM\225\275\006\231@\276V&;\276\202\212Z>\347a#\276\256\027\202\276\362\001Z>Vu\227\275P\247,>\2620\006>\251\220\210\276\340\255\374\273c\310\347=z\375\273=\nG\301\274\331\\\024\276\020@\'\276\257\004w>em\223=\336\202\256=\323\\\207>\3279\007>\240\365\221=;YT=R\225\360=\267\220\212>o\nu>\304\010c\276v\233X=\227O\204\276\352\331\023>L\317\222>\031\341\006>\333rG=\235\321\036\276\307\253\203>\256Y\256\275\312\2736>\231\030\311\275\3121\006>\264\027\255\275\367u6>\356\345Y>\315\263\272\274\"&\211\276\335\203\277=h\337L\276\005$\215=\300\3159\276\366.j>\3669q<\013\312\001>\235\352\214>N\342\001\275\354C\317;X\274\211>2\353\371\275\363\361\367\275\021\303\016\275m\257T\276\262l\367\275\276\361D\274L\215w>N\301\226=\037\240,\276\236m\210\276\023\203N=\ts\200>\355l\370\275\332\361\223=I\336\024\276\016j}>0G\344\275\016\353L\276\352\233\355\275\310cm=BQt>/8S=\312\323\225>>\360\375\275I\207D>\200\210t\276Tdr=\312~x\276\251[\200\276%Vi\274\365@\013\276\275\001Q\276\371-\350=`\202C>0G\010=\006\203\033\276\026\261|>\314\371\357\275F\033~\275\205\337\025\276\017x\036\275?\335w>\263\344\216>\202:%>\362\242\254=:uZ\276\n/A\275[e\264\275;\250\264=\224\264p>q\211\236\275\261@A>\"\211i\275\222\363\353\275\037i\371\275%\014v>G\357\221>\317\315U\275\266\016\372=@7\214>\327\0028>uo\023>:T\031>\010\366t>\341\232 >\222C\205>\375C\376\275Y.n\276\343\033}\275\356\351)=\242\346\246<\300\224\025\2765(\023=Vd\323\275\247L\n\275\377\320\242\275\242\334\252=h\355\215>\313\256c\274\177\'n>\356\340\226\275%\\\223\276\007\354\370=\017t`\275\035,\204\276qA\371\275\214\037\206\276\363:G>\035\252b\276\306\231n\276\360\361\034\276\312\234\'=\020\273\225=X\350\355=\310O\224<+\242\037\275`\ns>9o=\276/k8=7\211u\276\315\224\'\276\344\343~\276\225\255b>\203fX=\031\016\177\276\'9:\276S\323\t>\344\235\030>\225d\004>E\025\215>ZQ\323;9\026\207=k\"\210>\263\361\365\275RF\215=\251\371J>\354\275\221\276-\237{>\021\006\t>\243\0138\276\373\254\001>\260J:>0\314->;\350}>\205_\340\273\"\032f\276\031\353f>\206D\320\275f\206g=\355\355\217\276\315v\023>\0149\237\275\332M\275==\324\257\274?\376D>\357<o\276T\211:\276\'\026\211>\202h\325<\030\\\363=\002\273\020\276\"zo>\n\353\332\274\371v\343=\244,n\276\305(P>\t%\223\276\211\357\006\275\345=\206>\306\225 >\"+\324\273\t\2571=\014\234?\276Gm\312\275\212\253\370\274\220F\210>\023`\005\276\326&6>\300\340\320=\376s#>e@/;\324]\t=\203\330r\276\324s\307=B\236\326\2750\366\327=\273\331\203>\221xn=\323Z\241=\363\267\223\276i\214\332=dB\342=f\376X>\025ln\276\300\256\236;\322\017\214\276\030\333&=\025]\327\274Dg*\276\367\304\355=G\030S>\245,W\276\316\234?\274\003\031q>N\355G\276a\220v=\313\266\333\275e\371\323=\240\373$\276\300\304\025\276vb\273\275\263\364?\275j\347\277=5w\006\276\320\311 \276\257\r\366<\302\362\305\275wx8\276\224\2235>\177Bd\276h\331\234\275\321\211E>\337/U=>\233>\276P\002\027>6\n\212\276\372\327\333=\3564G=\027b\232\275~#\003\276\212\335\225>\037\202\212>\034n\221\276\371\254!\276R*P>\177\032n=\231Q\220>)\257p>c\003\331<\037VK\274\r\277Y>L\016`\276\250\223/>\231\363\223\276\315\264\'\2765,\235=\274\316\313=\243\251)<\330\236\320<+M\220\276c\246\350=\311#:>\034\020+=\337S\032\276A\3239\276j!\360\275W\211\\\276K\233\303=-+\216>GJH>k:I\276\243N\363=\000p\202\276\261\300\216\276r\247\315=c$(>\004?\222=\256}\272\275k\3465>\3200\364\275\002\323\224>\256D\225\275\021\222X\276\024\2308\276=\005 >\235}\207\276\376\213m>\217\311\005=\007\"\037<3\371\263\275\307\205G\276-Vm\276Pc\204\275\026 V>\210\312\364\275\315\375\233\275\2517|>\335]^>\356\0215\276\327\031Y\276\336\315u\276\350%\031\276\316\022g>\315<2\276S\252Q\276\364a\262=\220\213\351=9\016\027\273\363\200G\275\035\000\025>]}\032\275&\315\225>\241@D\276\037\000|>E\036\222\276\177\270=\276\014\265\341\273\326\210\021\275Uef>\234r\221\276\035)\263=\341\034\200\275\370L\355=d\347\213>\203QC<\255\203\007\274\244\271]\276\223Q\372\275\031P\215=Ivi\276J%\216\276\223\233\357\275J1\204\276:\301\211\276\270#Y\276m\023\222>]S\203>}\306\314=\233\276\352=\314\352->o\177\021\276\342H\232<B\311\320\274\213\326\343\275\270u\214>\334|\333=\253\260\031\276 3@>\344gq\276\032\3567\276\262S3>\261\363\221>\001\000\363=\275\013\265\275F4\217\276\t\357G\275y\325\264\275Z\307\327\273\271\326[\2762\031\364\275u@U>\270\237\356=\333\215,=\321}(>\020\016w\276:\010\021>\334\373\n>*\270\027>\352\366\n\276\330\231\216\276]yz>b\263u\275\241\262O<E%\340<\232\243L\275\315}\204\276(+8=\277S\276=*+A=\002\345\264=\204N\357\275\310\"\205\276\377\341P\276\276\241\315\275\340\027\t=\000I\257=\200\201\341=\022`u>\334Vg\2732\\\014\276\355]\305=\346sS=\325\275\371<\316\345n\276\375\025\250\275\225\212\210\276b\261\t>\227\354:>\262\0178\276]\360\213\2763\2773>7\301t\276\334\223\200\276\203\301\206\276\355\320j\276\226[P\276\014W\036\275o\263C\276k<\024>\316C\210\275\\\234*>\250f\267=3<\363\275\020\271\222\275\250\242q=\377\266]\2769\247\005>\264>Y>\374\027\010\276\265\224\204\276\0244\365=f\334\036\276\230$z\276\033<\206\276\211\234\207\276\266\365\n\276\333.\221>W\275c>?\0067>\246v\000>\362MM\276\251\235_\275]\006\225>\274\210\233<~v \276\214\234\344<\030\253\207\276\271V1=\372\362;\276\310\362G>[%\353<\003=\t\276X2\"\276\016^\016\275\276\304\216\275\350\311|>[\027\272=\2134\\>\313\241\214=q:w>f\362\376\275\256$U\276\304_\206\276\360\347\263=\256\215:<^|V>\307\323\216>\234\3110>\0332\317\275\306\220]\276\375\3163\276\326zi=\225\374\010>\021\013\276\275\005\242y>\332rd=\'Xu\275(\277\r\276Ywi>BV \276\330\356\'\276\351\024X\276\251@6>\2723\223\275\235y\032\276|\310\347\275y\"\246=\257W<\276R\300\323\275a\352\025\275\321\265\221\276\177]c\276)\241C>\317]y\27576\351\275\300%\373=k26>\344\250\204\276\331P\374\275\265\221I\276((<>\236{\304=\037\200\013\276\303\222\212>;\361w>\356ZM>\235\322\226\275\207:\265=\223d\350<\372&\037>\331\360\215\276\224\261\327\275\203\335G=\372\3312\276\\Hl\276\263\230\233\275\017\366 \276;\314\t\276v_\345\275\315w\253=\204\037\225>>\230z\276\364x\220\275\3670\026\276\223:\202>t\016\215\276\006\265X\276\2007\264=?-\272\275\342k\t>\320\245N\274\361,\316\274\247V\241\275\373\335F\276\023.i>T\224Y=\324\262\344=\004\336!\276lE\352<Bwn\276\014\265\035>~I\335= \361\202\276\271\204\205>\371\243\223>\024\036\344=\375\232r\276\246\313:\274\215\036E\276\020\016w=\331!\214>\235<\203>=\270\217>\242h~>g]\317\275\253+w\275\023r\255\273\261S\271\275\354\317\325\274\225\320\225\275\250\\\332\273\016\213$\276={\324=\356#\261=\"F\352<\340\0302>\275\267)\276\331j\206>\241b<=\360\212\204>\213h\210>\330[\021\275\005d^>\317\022\303\275\026\367\355=\203r\371\275\003\236\256=fp{=\311\305\010>\027qe\276^\003^\276A\373\265\275\347\026i\276I\212\024\276\006\307\273\275\242\345\305=\265\345\021;o\232\204<\224Rb>(\302\210\275\027\325\203=\262\224\022<_!\222>(\026t\276%\010\352=\331\2130\276\237\202X>\344w\257\275\267\242\325=B\034$\275\250lz\275$\371n\275\201\255Z>O\366u>z\037\031>Bs\030>*S|\275\212\252\236\275\002\304\211\275Q=!>o\377E=d\002\226\275bD2\276[S\200>[\223t\276\243\375m<Ba\201\276\214\333\307\275\341\241|\274\341(\271=\326\367\215\276\033\375:>\'U\035\276\356K\201\276!\216X\276\010r\223\275\024k\010>\232=\332\273\\\317\252<\270\246\215>\223\340\344=s*u\276\260v\221\276\220\362\246\275\033(\200\276\344\007\226=-:A\276\346\363t\275R\225J\276\232\247\337\275\270\350%\276Gi\200>\002ew\276\034#\213\276\023\332_>\342\206{>\233/g>\242\326\245=}\242H\275\226v\026=^\217\032=n=q>(\321\223\276\221\261\020>h\264+\275\206s\004>\357b\217=$\001,\275\362\352\203\276\222Id=\240S\222\275#\346J\276\n8\220>4\205\341=\277\243r\276\330\002\331\275\230\003\206\276\205q\272\275\317\232\275\275q\370\r\276>`\212>`\375o>\207G2>\343\372\016=F1\024>\226I\201>\250\247\277=\275\253\377=\035\203\021>\312\016\215=.W\235=\363\326X>M\364o\276\212gY\276\245\332\212>4)\257\275W\205C\276\306\236\244\2752\311$\276/\345A\275\227\343\315\275\373\330\215\276\230?n=\266g\300\275\323\275\255=\370\226\200\276\245\327O\275P\354Q>P\217\265\273\313W \276\004?\213\276\306\2105>\242*\304\275\335\206~>m\203\022\274[\200j>]-\224\276\266\226\300\275\367\216\362\275\'\251\237\275)Z\223\274[\201\220\275\001\271\220>\375\2704\276\324vO\276-^\337=\334Q\221\276K\\\362=\217\227\210\276Q\246d>w\235\302=<\215Y\275\377\242l\2765L\222\276YS\370\274=Td>r\346\202>\020;\214\276\023N\304==+\032>eA@\276Jy&\274d\024\362\275M}\320\275:\373T\275\262U@\276Ij\177\273\223T\023\276@J&\276\312\032\005\276K\334\357\275Z\266\215>8\334\306<\017.A>\234\267\207\276\335fU\276LT\343\275\364\217\033<\262\257\317\275\225\324%>\256\276\226\275\210\360]\274Y+\210\276p\255\222>+\007G=\n\305*\275\246\315\224\276;d\356\275\252&^\276\353,f>Y\310&>M\351\301\274\314\036?\276\205\034+=\224\237\312=\305\272\355\275\252\274\214\276x1\274=\277\342[\274\360\350\030=\223\204I\275\t\253h\276\006\035\232=-\233\005>p\353\016>\232\305\215\276/]1\275\273J\242\275\204g\241=yE\257=j\312\261\275q(R>z[\221\276\342.\233=:\000\n\276a\t\177\276\312+S\276\0022\373\275XZX>\303\237\250=m=*\276\tB\\>\261\271\223\276\021\301\272\273s<r\276\273\204\260\275(\223\335\275\376\205q\274\266d\265\275O/\317\274\363t\200>\241Lc\276\366XG\276\221\350o=\215\221\227\275\330QZ>\247v(>iy<\276\337\312\202>^\000;>\277t\200\276\320\2257\276\353\217S\276\214\010$\276x\240\202>\241\355\177<\346(\031\276\331ym\276R\003\177>\033:\347=\215[\356\274\017+\354\275\010Z\007>\300\371\204>U\221\327\275yPA\276\343Y\">K\322I>\'RT=\3446d>\004\337\373\272\303\373%>\037\\\224\276\236\224\243=\237El>\016\237\034\276\333\241\225\276^\031\204>\247\254<>\320\360\215\2769xJ>X@\000=\253[\222>\212r8<H\332\274=u\245\371\275\207\240\033\275\350\351\215\276\340.\235=|\376\'\272\004\001~\2751f\007>b\200\014\276\351\027\027\276\017\001\211>\346\031c>;\357\034\275\216A\225\276Z\235d=\222\217\335<jx\n=\320*D<\303\017E=?3\206>\210\325\362="
      }
    }
  }
}
node {
  name: "fully_connected/weights"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 36
        }
        dim {
          size: 34
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fully_connected/weights/Assign"
  op: "Assign"
  input: "fully_connected/weights"
  input: "fully_connected/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "fully_connected/weights/read"
  op: "Identity"
  input: "fully_connected/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected/MatMul"
  op: "MatMul"
  input: "input"
  input: "fully_connected/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "fully_connected/bias/Initializer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 34
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "fully_connected/bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 34
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fully_connected/bias/Assign"
  op: "Assign"
  input: "fully_connected/bias"
  input: "fully_connected/bias/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "fully_connected/bias/read"
  op: "Identity"
  input: "fully_connected/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "fully_connected/MatMul"
  input: "fully_connected/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected/Relu"
  op: "Relu"
  input: "fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected_1/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 34
          }
          dim {
            size: 2
          }
        }
        tensor_content: "=,x\276\002\252\256\276\324\222\272\2761\300\345\274\210 q\276\036~\277<e\275\270>\326\254,\276Lc\313\276=n\204<i\303\250>\036\211y>\257\313X>\261\336\266\276\275o\022\276\303P\240\276\267]\315\276=\343\300\274\341\004\234\276Z\345\343=\202U\261\275\t\257\222>\320\243\316=\3734\304>c\336\311=\032\267\373=\341u_\276y\216\022\276\304\264M>\001\340\244;\215\227>\276I\354\331<\332\254\237>\246\321\274=\312F\202<\323R\020>I\265\246\275\221\365\300>\272@\325=\025\345l=\364\242<>\301\250\215>\0277\206>\034\033\020>\210\206\210\276\220-#>\245\305\305\276N_\374=\211\010\310>\023\236\233>\264\023\222\275q3\314\2724e/\276\362\250_>,\177\227>\243}\270=\364C}>\215\374T\274m\203P\276C\013^>\203.\234>\004\226z>l\317L>\223!\245>\226\016\205>\217\003\215\275=c\263\276\t\241\362\275"
      }
    }
  }
}
node {
  name: "fully_connected_1/weights"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 34
        }
        dim {
          size: 2
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fully_connected_1/weights/Assign"
  op: "Assign"
  input: "fully_connected_1/weights"
  input: "fully_connected_1/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "fully_connected_1/weights/read"
  op: "Identity"
  input: "fully_connected_1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected_1/MatMul"
  op: "MatMul"
  input: "fully_connected/Relu"
  input: "fully_connected_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "fully_connected_1/bias/Initializer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "fully_connected_1/bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fully_connected_1/bias/Assign"
  op: "Assign"
  input: "fully_connected_1/bias"
  input: "fully_connected_1/bias/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "fully_connected_1/bias/read"
  op: "Identity"
  input: "fully_connected_1/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected_1/BiasAdd"
  op: "BiasAdd"
  input: "fully_connected_1/MatMul"
  input: "fully_connected_1/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/HistogramSummary/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "linear_regression.X"
      }
    }
  }
}
node {
  name: "linear_regression/HistogramSummary"
  op: "HistogramSummary"
  input: "linear_regression/HistogramSummary/tag"
  input: "fully_connected_1/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "linear_regression.y"
      }
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_1"
  op: "HistogramSummary"
  input: "linear_regression/HistogramSummary_1/tag"
  input: "output"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\002\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -1.22474491596
      }
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.22474491596
      }
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "linear_regression/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 38
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "linear_regression/weights/Initializer/random_uniform/max"
  input: "linear_regression/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "linear_regression/weights/Initializer/random_uniform/RandomUniform"
  input: "linear_regression/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform"
  op: "Add"
  input: "linear_regression/weights/Initializer/random_uniform/mul"
  input: "linear_regression/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/weights"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
        dim {
          size: 2
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "linear_regression/weights/Assign"
  op: "Assign"
  input: "linear_regression/weights"
  input: "linear_regression/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "linear_regression/weights/read"
  op: "Identity"
  input: "linear_regression/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -1.73205077648
      }
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.73205077648
      }
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "linear_regression/bias/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 48
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/sub"
  op: "Sub"
  input: "linear_regression/bias/Initializer/random_uniform/max"
  input: "linear_regression/bias/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/mul"
  op: "Mul"
  input: "linear_regression/bias/Initializer/random_uniform/RandomUniform"
  input: "linear_regression/bias/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform"
  op: "Add"
  input: "linear_regression/bias/Initializer/random_uniform/mul"
  input: "linear_regression/bias/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "linear_regression/bias/Assign"
  op: "Assign"
  input: "linear_regression/bias"
  input: "linear_regression/bias/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "linear_regression/bias/read"
  op: "Identity"
  input: "linear_regression/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_2/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "linear_regression.weights"
      }
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_2"
  op: "HistogramSummary"
  input: "linear_regression/HistogramSummary_2/tag"
  input: "linear_regression/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_3/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "linear_regression.bias"
      }
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_3"
  op: "HistogramSummary"
  input: "linear_regression/HistogramSummary_3/tag"
  input: "linear_regression/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/xw_plus_b/MatMul"
  op: "MatMul"
  input: "fully_connected_1/BiasAdd"
  input: "linear_regression/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/xw_plus_b"
  op: "BiasAdd"
  input: "linear_regression/mean_squared_error_regressor/xw_plus_b/MatMul"
  input: "linear_regression/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/sub"
  op: "Sub"
  input: "output"
  input: "linear_regression/mean_squared_error_regressor/xw_plus_b"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/Mul"
  op: "Mul"
  input: "linear_regression/mean_squared_error_regressor/sub"
  input: "linear_regression/mean_squared_error_regressor/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/Rank"
  op: "Rank"
  input: "linear_regression/mean_squared_error_regressor/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/range"
  op: "Range"
  input: "linear_regression/mean_squared_error_regressor/range/start"
  input: "linear_regression/mean_squared_error_regressor/Rank"
  input: "linear_regression/mean_squared_error_regressor/range/delta"
}
node {
  name: "linear_regression/mean_squared_error_regressor/Mean"
  op: "Mean"
  input: "linear_regression/mean_squared_error_regressor/Mul"
  input: "linear_regression/mean_squared_error_regressor/range"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "ScalarSummary/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "loss"
      }
    }
  }
}
node {
  name: "ScalarSummary"
  op: "ScalarSummary"
  input: "ScalarSummary/tags"
  input: "linear_regression/mean_squared_error_regressor/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MergeSummary/MergeSummary"
  op: "MergeSummary"
  input: "HistogramSummary"
  input: "HistogramSummary_1"
  input: "linear_regression/HistogramSummary"
  input: "linear_regression/HistogramSummary_1"
  input: "linear_regression/HistogramSummary_2"
  input: "linear_regression/HistogramSummary_3"
  input: "ScalarSummary"
  attr {
    key: "N"
    value {
      i: 7
    }
  }
}
node {
  name: "learning_rate/Initializer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "learning_rate"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "learning_rate/Assign"
  op: "Assign"
  input: "learning_rate"
  input: "learning_rate/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "learning_rate/read"
  op: "Identity"
  input: "learning_rate"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Shape"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "gradients/Fill"
  op: "Fill"
  input: "gradients/Shape"
  input: "gradients/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Rank"
  op: "Rank"
  input: "linear_regression/mean_squared_error_regressor/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_1"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/range"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range"
  op: "Range"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range/start"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Rank"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range/delta"
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Fill/value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Fill"
  op: "Fill"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_1"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Fill/value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/DynamicStitch"
  op: "DynamicStitch"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range"
  input: "linear_regression/mean_squared_error_regressor/range"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Fill"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/floordiv"
  op: "Div"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/DynamicStitch"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Reshape"
  op: "Reshape"
  input: "gradients/Fill"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/DynamicStitch"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Tile"
  op: "Tile"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Reshape"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/floordiv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_2"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_3"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Rank_1"
  op: "Rank"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_1/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_1/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_1"
  op: "Range"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_1/start"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Rank_1"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_1/delta"
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Prod"
  op: "Prod"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_2"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Rank_2"
  op: "Rank"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_3"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_2/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_2/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_2"
  op: "Range"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_2/start"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Rank_2"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_2/delta"
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Prod_1"
  op: "Prod"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_3"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range_2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/floordiv_1"
  op: "Div"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Prod"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Prod_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Cast"
  op: "Cast"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/floordiv_1"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/truediv"
  op: "Div"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Tile"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Cast"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Shape"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Shape_1"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Shape"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Shape_1"
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/mul"
  op: "Mul"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/truediv"
  input: "linear_regression/mean_squared_error_regressor/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Sum"
  op: "Sum"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/mul"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Reshape"
  op: "Reshape"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Sum"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/mul_1"
  op: "Mul"
  input: "linear_regression/mean_squared_error_regressor/sub"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/truediv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Sum_1"
  op: "Sum"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/mul_1"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Reshape_1"
  op: "Reshape"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Sum_1"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/AddN"
  op: "AddN"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Reshape"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mul_grad/Reshape_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/sub_grad/Shape"
  op: "Shape"
  input: "output"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/sub_grad/Shape_1"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/xw_plus_b"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/sub_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "gradients/linear_regression/mean_squared_error_regressor/sub_grad/Shape"
